controllers/ArticleController.php

    public function actionCreate()
    {
        $oArticle = new Article();

        if ($oArticle->load(Yii::$app->request->post())) {
            $oArticle->user_id = Yii::$app->user->identity->id;
            if ($oArticle->save())
---
INSERT INTO `article` (`title`, `text`, `user_id`, `date_create`, `date_update`) VALUES ('123', '123', 2, NOW(), NOW())

    protected function findModel($id)
    {
        if (($model = Article::findOne($id)) !== null) {
---
SELECT * FROM `article` WHERE `id`='1'