controllers/SiteController.php

    public function actionArticle($id)
    {
        $oComment = new Comment;

        if ($oComment->load(Yii::$app->request->post()))
        {
            $oComment->article_id = $id;
            $oComment->user_id = Yii::$app->user->identity ? Yii::$app->user->identity->id : null;

            if($oComment->save())
                return $this->redirect(['article', 'id' => $id]);
        }
        else
            return $this->render('article', [
                'oArticle' => Article::findOne($id),
                'oComment' => $oComment,
            ]);
---
INSERT INTO `comment` (`text`, `article_id`, `user_id`) VALUES ('еще коммент', 1, 1)
SELECT * FROM `article` WHERE `id`='1'