models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['login' => $username]);
---
SELECT * FROM `user` WHERE `login`='admin'